src/InformationRegisters/Профосмотры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>Профосмотры</Name>
			<Comment>Хранит историю проведения и планирования профосмотров</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаЗапланированная</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Comment>Статус</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПрофосмотров</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Сделка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сделки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредварительнаяЗапись</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Событие</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаОтказа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПричиныОтменыЗаписи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Прием</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Прием</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправившийВрач</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвторЗаписи</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаНаправления</Name>
					<Comment>Причина направления к врачу</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаПереноса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПричиныОтменыЗаписи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Длительность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Специализация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Специализации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидОсмотра</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОсмотров</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/СтатусыПрофосмотров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СтатусыПрофосмотров</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Запланирован</Name>
					<Comment>Запланирован</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Согласился</Name>
					<Comment>Согласился</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НапомнитьПозже</Name>
					<Comment>Напомнить позже</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отказался</Name>
					<Comment>Отказался</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ВидыОсмотров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВидыОсмотров</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Направление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОчередьНаЗапись</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Профосмотр</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПовторныйПрием</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Documents/Событие.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>Событие</Name>
			<Comment>Предварительная запись клиента</Comment>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АвторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЦен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Врач</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяНапоминанияДоЗаписи</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВходящийНомерТелефона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторДиалога</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникЗаписи</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиЗаписей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КартаКлиента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Карты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодСинхронизации</Name>
					<Comment>Код синхронизации с ID загружаемой базы</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеРезерва</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПеренесённаяПредварительнаяЗапись</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Событие</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолисМедСтрахования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПолисыМедицинскогоСтрахования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаОтмены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПричиныОтменыЗаписи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Резерв</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сделка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сделки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СсылкаНаПрием</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Прием</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыСобытия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусПациента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТелефонныйЗвонок</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСобытия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСобытий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УИД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветФонаРезерва</Name>
					<Comment>Цвет фона резерва</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Услуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НормаВремени</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Помещение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Помещения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПризнакЗаблокированно</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПричинаЗаписи</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПричиныЗаписи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/InformationRegisters/Профосмотры/Ext/ManagerModule.bsl
#Область СлужебныйПрограммныйИнтерфейс

// Процедура осуществляет запись данных в регистр профосмотров по данным документа Прием  
//
Процедура ЗаписьПоПланированиюПрофосмотров(ПриемСсылка, ОтменитьЗапись = Ложь) Экспорт
	
	//Если НЕ ЗначениеЗаполнено(ПриемСсылка) Тогда
	//    Возврат;
	//КонецЕсли;		
	//НаборЗаписей = РегистрыСведений.Профосмотры.СоздатьНаборЗаписей();			
	//// Если проведение документа отменено удалить запись по регистру
	//Если ОтменитьЗапись ИЛИ НЕ ПриемСсылка.Проведен Тогда	
	//	НаборЗаписей.Отбор.Контрагент.Значение               = ПриемСсылка.Контрагент;
	//	НаборЗаписей.Отбор.Контрагент.Использование          = Истина;
	//	НаборЗаписей.Отбор.Сотрудник.Значение                = ПриемСсылка.Сотрудник;
	//	НаборЗаписей.Отбор.Сотрудник.Использование           = Истина;	
	//	НаборЗаписей.Отбор.СтруктурнаяЕдиница.Значение       = ПриемСсылка.СтруктурнаяЕдиница;
	//	НаборЗаписей.Отбор.СтруктурнаяЕдиница.Использование  = Истина;	
	//	НаборЗаписей.Отбор.ВидОсмотра.Значение               = Перечисления.ВидыОсмотров.Профосмотр;
	//	НаборЗаписей.Отбор.ВидОсмотра.Использование          = Истина;	
	//	НаборЗаписей.Прочитать();		
	//	// Удаляем записи регистра с указанным приемом
	//	СчетчикИнд = 0;
	//	Пока СчетчикИнд < НаборЗаписей.Количество() Цикл		
	//		Если НаборЗаписей[СчетчикИнд].Прием = ПриемСсылка Тогда
	//			НаборЗаписей.Удалить(СчетчикИнд);
	//		Иначе
	//			СчетчикИнд = СчетчикИнд + 1;
	//		КонецЕсли;			
	//	КонецЦикла;		
	//	НаборЗаписей.Записать(Истина);		
	//// Если документ проведен и профосмотр используется сделать запись в регистр
	//ИначеЕсли ПриемСсылка.Проведен И ПриемСсылка.ПрофосмотрИспользовать Тогда		
	//	НоваяЗапись                                         = НаборЗаписей.Добавить();	
	//	НаборЗаписей.Отбор.Контрагент.Значение              = ПриемСсылка.Контрагент;
	//	НаборЗаписей.Отбор.Контрагент.Использование         = Истина;
	//	НаборЗаписей.Отбор.Сотрудник.Значение               = ПриемСсылка.Сотрудник;
	//	НаборЗаписей.Отбор.Сотрудник.Использование          = Истина;
	//	НаборЗаписей.Отбор.Период.Значение                  = ПриемСсылка.Дата;
	//	НаборЗаписей.Отбор.Период.Использование             = Истина;
	//	НаборЗаписей.Отбор.СтруктурнаяЕдиница.Значение      = ПриемСсылка.СтруктурнаяЕдиница;
	//	НаборЗаписей.Отбор.СтруктурнаяЕдиница.Использование = Истина;
	//	НаборЗаписей.Отбор.ВидОсмотра.Значение              = Перечисления.ВидыОсмотров.Профосмотр;
	//	НаборЗаписей.Отбор.ВидОсмотра.Использование         = Истина;	
	//	
	//	НоваяЗапись.ВидОсмотра          = Перечисления.ВидыОсмотров.Профосмотр;
	//	НоваяЗапись.Период              = ПриемСсылка.Дата; 
	//	НоваяЗапись.Прием               = ПриемСсылка;
	//	НоваяЗапись.СтруктурнаяЕдиница  = ПриемСсылка.СтруктурнаяЕдиница;
	//	НоваяЗапись.Контрагент          = ПриемСсылка.Контрагент;
	//	НоваяЗапись.Сотрудник           = ПриемСсылка.Сотрудник;
	//	НоваяЗапись.АвторЗаписи         = ПараметрыСеанса.ТекущийПользователь;
	//	НоваяЗапись.ДатаЗапланированная = ДобавитьМесяц(НоваяЗапись.Период, ПриемСсылка.ПрофосмотрИнтервал);
	//	НоваяЗапись.Статус              = Перечисления.СтатусыПрофосмотров.Запланирован;	
	//	НаборЗаписей.Записать(Истина);
	//КонецЕсли;
	
КонецПроцедуры

// Процедура - Актуализировать статус планирования приема
//
// Параметры:
//  СтруктурнаяЕдиница		 - 	 - 
//  Контрагент				 - 	 - 
//  Сделка					 - 	 - 
//  ПредварительнаяЗапись	 - 	 - 
//  АктуальныйСтатус		 - 	 - 
//
Процедура АктуализироватьСтатусПланированияПриема(СтруктурнаяЕдиница 	= Неопределено
												, Контрагент 			= Неопределено
												, Сделка 				= Неопределено
												, ПредварительнаяЗапись = Неопределено
												, АктуальныйСтатус
												, ПричинаОтказа 		= Неопределено) Экспорт
												
	Если НЕ ЗначениеЗаполнено(Контрагент) Тогда 
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПланированиеПриемов.Период КАК Период,
	|	ПланированиеПриемов.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ПланированиеПриемов.Контрагент КАК Контрагент,
	|	ПланированиеПриемов.Сотрудник КАК Сотрудник,
	|	ПланированиеПриемов.ВидОсмотра КАК ВидОсмотра,
	|	ПланированиеПриемов.ДатаЗапланированная КАК ДатаЗапланированная,
	|	ПланированиеПриемов.Статус КАК Статус,
	|	ПланированиеПриемов.Сделка КАК Сделка,
	|	ПланированиеПриемов.ПредварительнаяЗапись КАК ПредварительнаяЗапись,
	|	ПланированиеПриемов.ПричинаОтказа КАК ПричинаОтказа,
	|	ПланированиеПриемов.Прием КАК Прием,
	|	ПланированиеПриемов.НаправившийВрач КАК НаправившийВрач,
	|	ПланированиеПриемов.АвторЗаписи КАК АвторЗаписи,
	|	ПланированиеПриемов.ПричинаНаправления КАК ПричинаНаправления,
	|	ПланированиеПриемов.ПричинаПереноса КАК ПричинаПереноса,
	|	ПланированиеПриемов.Комментарий КАК Комментарий,
	|	ПланированиеПриемов.Длительность КАК Длительность,
	|	ПланированиеПриемов.Специализация КАК Специализация
	|ПОМЕСТИТЬ ТаблицаПланированияПриемовКонтрагента
	|ИЗ
	|	РегистрСведений.Профосмотры КАК ПланированиеПриемов
	|ГДЕ
	|	ПланированиеПриемов.Контрагент = &Контрагент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаПланированияПриемовКонтрагента.Период КАК Период,
	|	ТаблицаПланированияПриемовКонтрагента.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ТаблицаПланированияПриемовКонтрагента.Контрагент КАК Контрагент,
	|	ТаблицаПланированияПриемовКонтрагента.Сотрудник КАК Сотрудник,
	|	ТаблицаПланированияПриемовКонтрагента.ВидОсмотра КАК ВидОсмотра,
	|	ТаблицаПланированияПриемовКонтрагента.ДатаЗапланированная КАК ДатаЗапланированная,
	|	ТаблицаПланированияПриемовКонтрагента.Статус КАК Статус,
	|	ТаблицаПланированияПриемовКонтрагента.Сделка КАК Сделка,
	|	ТаблицаПланированияПриемовКонтрагента.ПредварительнаяЗапись КАК ПредварительнаяЗапись,
	|	ТаблицаПланированияПриемовКонтрагента.ПричинаОтказа КАК ПричинаОтказа,
	|	ТаблицаПланированияПриемовКонтрагента.Прием КАК Прием,
	|	ТаблицаПланированияПриемовКонтрагента.НаправившийВрач КАК НаправившийВрач,
	|	ТаблицаПланированияПриемовКонтрагента.АвторЗаписи КАК АвторЗаписи,
	|	ТаблицаПланированияПриемовКонтрагента.ПричинаНаправления КАК ПричинаНаправления,
	|	ТаблицаПланированияПриемовКонтрагента.ПричинаПереноса КАК ПричинаПереноса,
	|	ТаблицаПланированияПриемовКонтрагента.Комментарий КАК Комментарий,
	|	ТаблицаПланированияПриемовКонтрагента.Длительность КАК Длительность,
	|	ТаблицаПланированияПриемовКонтрагента.Специализация КАК Специализация
	|ИЗ
	|	ТаблицаПланированияПриемовКонтрагента КАК ТаблицаПланированияПриемовКонтрагента
	|ГДЕ
	|	&УсловиеПоиска";
	
	Если АктуальныйСтатус = Перечисления.СтатусыПрофосмотров.Согласился Тогда 
		Если НЕ ЗначениеЗаполнено(Сделка) ИЛИ НЕ ЗначениеЗаполнено(ПредварительнаяЗапись) Тогда
			Возврат;
		КонецЕсли;	
		УсловиеПоиска = "ТаблицаПланированияПриемовКонтрагента.Статус В (ЗНАЧЕНИЕ(Перечисление.СтатусыПрофосмотров.Запланирован), ЗНАЧЕНИЕ(Перечисление.СтатусыПрофосмотров.НапомнитьПозже))
	|	И ТаблицаПланированияПриемовКонтрагента.Сделка = &Сделка
	|	И ТаблицаПланированияПриемовКонтрагента.ПредварительнаяЗапись = ЗНАЧЕНИЕ(Документ.Событие.ПустаяСсылка)";
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПоиска", УсловиеПоиска);
		Запрос.УстановитьПараметр("Сделка", Сделка);
		
		ВыборкаСтрокиПланирования = Запрос.Выполнить().Выбрать();
		Пока ВыборкаСтрокиПланирования.Следующий() Цикл  
			НаборЗаписей = СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Период.Установить(ВыборкаСтрокиПланирования.Период);
			НаборЗаписей.Отбор.СтруктурнаяЕдиница.Установить(ВыборкаСтрокиПланирования.СтруктурнаяЕдиница);
			НаборЗаписей.Отбор.Контрагент.Установить(ВыборкаСтрокиПланирования.Контрагент);
			НаборЗаписей.Отбор.Сотрудник.Установить(ВыборкаСтрокиПланирования.Сотрудник);
			НаборЗаписей.Отбор.ВидОсмотра.Установить(ВыборкаСтрокиПланирования.ВидОсмотра);
			ЗаписьПланирования 							= НаборЗаписей.Добавить();
			ЗаполнитьЗначенияСвойств(ЗаписьПланирования, ВыборкаСтрокиПланирования);
			ЗаписьПланирования.Статус 					= АктуальныйСтатус;
			ЗаписьПланирования.ПредварительнаяЗапись 	= ПредварительнаяЗапись;
			НаборЗаписей.ОбменДанными.Загрузка 			= Истина;		
			Попытка
				НаборЗаписей.Записать();
			Исключение
				
			КонецПопытки;
		КонецЦикла;
	ИначеЕсли АктуальныйСтатус = Перечисления.СтатусыПрофосмотров.Отказался Тогда	
		Если НЕ ЗначениеЗаполнено(Сделка) Тогда
			Возврат;
		КонецЕсли;	
		УсловиеПоиска = "ТаблицаПланированияПриемовКонтрагента.Статус В (ЗНАЧЕНИЕ(Перечисление.СтатусыПрофосмотров.Запланирован), ЗНАЧЕНИЕ(Перечисление.СтатусыПрофосмотров.Согласился), ЗНАЧЕНИЕ(Перечисление.СтатусыПрофосмотров.НапомнитьПозже))
	|	И ТаблицаПланированияПриемовКонтрагента.Сделка = &Сделка";
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПоиска", УсловиеПоиска);
		Запрос.УстановитьПараметр("Сделка", Сделка);
		
		ВыборкаСтрокиПланирования = Запрос.Выполнить().Выбрать();
		Пока ВыборкаСтрокиПланирования.Следующий() Цикл  
			НаборЗаписей = СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Период.Установить(ВыборкаСтрокиПланирования.Период);
			НаборЗаписей.Отбор.СтруктурнаяЕдиница.Установить(ВыборкаСтрокиПланирования.СтруктурнаяЕдиница);
			НаборЗаписей.Отбор.Контрагент.Установить(ВыборкаСтрокиПланирования.Контрагент);
			НаборЗаписей.Отбор.Сотрудник.Установить(ВыборкаСтрокиПланирования.Сотрудник);
			НаборЗаписей.Отбор.ВидОсмотра.Установить(ВыборкаСтрокиПланирования.ВидОсмотра);
			ЗаписьПланирования 							= НаборЗаписей.Добавить();
			ЗаполнитьЗначенияСвойств(ЗаписьПланирования, ВыборкаСтрокиПланирования);
			ЗаписьПланирования.Статус 					= АктуальныйСтатус;
			//ЗаписьПланирования.ПричинаОтказа 			= ?(ЗначениеЗаполнено(ПричинаОтказа), ПричинаОтказа, ВыборкаСтрокиПланирования.ПричинаОтказа);
			НаборЗаписей.ОбменДанными.Загрузка 			= Истина;		
			Попытка
				НаборЗаписей.Записать();
			Исключение
				
			КонецПопытки;
		КонецЦикла;
	Иначе 
		Возврат;
	КонецЕсли;	
	
КонецПроцедуры

// Функция - Получить направившего врача
//
// Параметры:
//  Контрагент				 - 	 - 
//  ПредварительнаяЗапись	 - 	 - 
//  Сделка					 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьНаправившегоВрача(Контрагент 			= Неопределено
								, ПредварительнаяЗапись = Неопределено
								, Сделка 				= Неопределено) Экспорт 
								
	Если НЕ ЗначениеЗаполнено(ПредварительнаяЗапись) И НЕ ЗначениеЗаполнено(Сделка) Тогда 
		Возврат Неопределено;
	КонецЕсли;		
								
	Если НЕ ПривилегированныйРежим() Тогда 
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;	
		
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Направление"				, Перечисления.ВидыОсмотров.Направление);
	Запрос.УстановитьПараметр("ПредварительнаяЗапись"	, ПредварительнаяЗапись);
	Запрос.УстановитьПараметр("Сделка"					, Сделка);	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Профосмотры.НаправившийВрач КАК НаправившийВрач
	|ИЗ
	|	РегистрСведений.Профосмотры КАК Профосмотры
	|ГДЕ
	|	Профосмотры.Контрагент = &Контрагент
	|	И Профосмотры.ВидОсмотра = &Направление
	|	И Профосмотры.Сделка = &Сделка
	|	И Профосмотры.ПредварительнаяЗапись = &ПредварительнаяЗапись";
	
	Если ЗначениеЗаполнено(Контрагент) Тогда 
		Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Иначе 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Профосмотры.Контрагент = &Контрагент
	|	И ", "");
	КонецЕсли;	
	
	Если НЕ ЗначениеЗаполнено(ПредварительнаяЗапись) Тогда 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И Профосмотры.ПредварительнаяЗапись = &ПредварительнаяЗапись", "");
		Если НЕ ЗначениеЗаполнено(Контрагент) Тогда 
			Запрос.УстановитьПараметр("Контрагент", ОбщегоНазначения.ПолучитьЗначениеРеквизита(Сделка, "Контрагент"));
		КонецЕсли;	
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Сделка) Тогда 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И Профосмотры.Сделка = &Сделка", "");
		Если НЕ ЗначениеЗаполнено(Контрагент) Тогда 
			Запрос.УстановитьПараметр("Контрагент", ОбщегоНазначения.ПолучитьЗначениеРеквизита(ПредварительнаяЗапись, "Контрагент"));
		КонецЕсли;			
	КонецЕсли;
	
	ВыборкаВрача = Запрос.Выполнить().Выбрать();
	Если ВыборкаВрача.Следующий() Тогда 
		Возврат ВыборкаВрача.НаправившийВрач;
	Иначе 
		Возврат Неопределено;
	КонецЕсли;	
	
КонецФункции

// Функция - Получить прошлый прием
//
// Параметры:
//  Контрагент				 - 	 - 
//  ПредварительнаяЗапись	 - 	 - 
//  Сделка					 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьПрошлыйПрием(Контрагент 			= Неопределено
							, ПредварительнаяЗапись = Неопределено
							, Сделка 				= Неопределено) Экспорт 
								
	Если НЕ ЗначениеЗаполнено(ПредварительнаяЗапись) И НЕ ЗначениеЗаполнено(Сделка) Тогда 
		Возврат Неопределено;
	КонецЕсли;		
								
	Если НЕ ПривилегированныйРежим() Тогда 
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;	
		
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПовторныйПрием"			, Перечисления.ВидыОсмотров.ПовторныйПрием);
	Запрос.УстановитьПараметр("ПредварительнаяЗапись"	, ПредварительнаяЗапись);
	Запрос.УстановитьПараметр("Сделка"					, Сделка);	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Профосмотры.Прием КАК Прием
	|ИЗ
	|	РегистрСведений.Профосмотры КАК Профосмотры
	|ГДЕ
	|	Профосмотры.Контрагент = &Контрагент
	|	И Профосмотры.ВидОсмотра = &ПовторныйПрием
	|	И Профосмотры.Сделка = &Сделка
	|	И Профосмотры.ПредварительнаяЗапись = &ПредварительнаяЗапись";
	
	Если ЗначениеЗаполнено(Контрагент) Тогда 
		Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Иначе 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Профосмотры.Контрагент = &Контрагент
	|	И ", "");
	КонецЕсли;	
	
	Если НЕ ЗначениеЗаполнено(ПредварительнаяЗапись) Тогда 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И Профосмотры.ПредварительнаяЗапись = &ПредварительнаяЗапись", "");
		Если НЕ ЗначениеЗаполнено(Контрагент) Тогда 
			Запрос.УстановитьПараметр("Контрагент", ОбщегоНазначения.ПолучитьЗначениеРеквизита(Сделка, "Контрагент"));
		КонецЕсли;	
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Сделка) Тогда 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И Профосмотры.Сделка = &Сделка", "");
		Если НЕ ЗначениеЗаполнено(Контрагент) Тогда 
			Запрос.УстановитьПараметр("Контрагент", ОбщегоНазначения.ПолучитьЗначениеРеквизита(ПредварительнаяЗапись, "Контрагент"));
		КонецЕсли;			
	КонецЕсли;
	
	ВыборкаПриема = Запрос.Выполнить().Выбрать();
	Если ВыборкаПриема.Следующий() Тогда 
		Возврат ВыборкаПриема.Прием;
	Иначе 
		Возврат Неопределено;
	КонецЕсли;	
	
КонецФункции

// Функция - Получить запланированые сделки
//
// Параметры:
//  ДатаГенерации		 - 	 - 
//  СтруктурнаяЕдиница	 - 	 - 
//  Контрагент			 - 	 - 
//  Врач				 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьЗапланированыеСделки(ДатаГенерации
									, СтруктурнаяЕдиница = Неопределено
									, Контрагент = Неопределено
									, Врач = Неопределено) Экспорт
									
	Если НЕ ПривилегированныйРежим() Тогда 
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаГенерации", ДатаГенерации);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Профосмотры.Сделка КАК Сделка
	|ИЗ
	|	РегистрСведений.Профосмотры КАК Профосмотры
	|ГДЕ
	|	НАЧАЛОПЕРИОДА(Профосмотры.Период, ДЕНЬ) = НАЧАЛОПЕРИОДА(&ДатаГенерации, ДЕНЬ)
	|	И Профосмотры.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|	И Профосмотры.Контрагент = &Контрагент
	|	И Профосмотры.Сотрудник = &Сотрудник
	|	И Профосмотры.Сделка <> ЗНАЧЕНИЕ(Справочник.Сделки.ПустаяСсылка)";
	
	Если ЗначениеЗаполнено(СтруктурнаяЕдиница) Тогда 
		Запрос.УстановитьПараметр("СтруктурнаяЕдиница", СтруктурнаяЕдиница);
	Иначе 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И Профосмотры.СтруктурнаяЕдиница = &СтруктурнаяЕдиница", "");
	КонецЕсли;								
	
	Если ЗначениеЗаполнено(Контрагент) Тогда 
		Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Иначе 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И Профосмотры.Контрагент = &Контрагент", "");
	КонецЕсли;								

	Если ЗначениеЗаполнено(Врач) Тогда 
		Запрос.УстановитьПараметр("Сотрудник", Врач);
	Иначе 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И Профосмотры.Сотрудник = &Сотрудник", "");
	КонецЕсли;								
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Сделка");
	
КонецФункции

// Процедура, записать данные в регистр профосмотры
//
Процедура ЗаписатьДанныеВРегистрПрофосмотры(ТаблицаНаправлений
	                                        , Сотрудник
											, СтруктурнаяЕдиница
											, Контрагент
											, Прием) Экспорт 
											
	Если НЕ ПривилегированныйРежим() Тогда 
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;	
												
	Для Каждого СтрокаТЧ Из ТаблицаНаправлений Цикл
		
		НаборЗаписей                                        = РегистрыСведений.Профосмотры.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Период.Значение                  = СтрокаТЧ.Период; 
		НаборЗаписей.Отбор.Период.Использование             = Истина;
		НаборЗаписей.Отбор.СтруктурнаяЕдиница.Значение      = СтруктурнаяЕдиница;
		НаборЗаписей.Отбор.СтруктурнаяЕдиница.Использование = Истина;
		НаборЗаписей.Отбор.Контрагент.Значение              = Контрагент; 
		НаборЗаписей.Отбор.Контрагент.Использование         = Истина; 
		НаборЗаписей.Отбор.ВидОсмотра.Значение              = СтрокаТЧ.ВидОсмотра;
		НаборЗаписей.Отбор.ВидОсмотра.Использование         = Истина;
		НаборЗаписей.Прочитать();
		Если НаборЗаписей.Количество() = 0 Тогда
			Если СтрокаТЧ.НаправленКСпециалисту Тогда
				НоваяЗапись                     = НаборЗаписей.Добавить(); 
				ЗаполнитьЗначенияСвойств(НоваяЗапись, СтрокаТЧ); 
				НоваяЗапись.СтруктурнаяЕдиница  = СтруктурнаяЕдиница;
				НоваяЗапись.Контрагент          = Контрагент;
				НоваяЗапись.Прием               = Прием;
				НоваяЗапись.АвторЗаписи         = ПараметрыСеанса.ТекущийСотрудник;
				НоваяЗапись.Статус              = Перечисления.СтатусыПрофосмотров.Запланирован;
				Если НоваяЗапись.ВидОсмотра     = Перечисления.ВидыОсмотров.Направление Тогда 
					НоваяЗапись.НаправившийВрач = Сотрудник; 
				КонецЕсли;
				Если ЗначениеЗаполнено(СтрокаТЧ.Сотрудник) Тогда  
					НоваяЗапись.Сотрудник = СтрокаТЧ.Сотрудник; 
				КонецЕсли; 	
				НаборЗаписей.Записать(); 
			Иначе
				Продолжить;
			КонецЕсли;
		Иначе  
			НоваяЗапись = НаборЗаписей[0];
			Если СтрокаТЧ.НаправленКСпециалисту = Ложь И НЕ ЗначениеЗаполнено(НоваяЗапись.ПредварительнаяЗапись) Тогда					 
				Если ЗначениеЗаполнено(НоваяЗапись.Сделка) Тогда
					СделкаИзЗаписи                       = НоваяЗапись.Сделка.ПолучитьОбъект();
					СделкаИзЗаписи.ПометкаУдаления       = Истина;
					СделкаИзЗаписи.ОбменДанными.Загрузка = Истина;
					СделкаИзЗаписи.Записать();
				КонецЕсли;
				НаборЗаписей.Удалить(НаборЗаписей[0]); 
				НаборЗаписей.Записать(); 			
			Иначе 
				Если Не ЗначениеЗаполнено(СтрокаТЧ.ПредварительнаяЗапись) И НоваяЗапись.ВидОсмотра = Перечисления.ВидыОсмотров.ПовторныйПрием Тогда
					НоваяЗапись.Длительность        = СтрокаТЧ.Длительность;
					НоваяЗапись.ДатаЗапланированная = СтрокаТЧ.ДатаЗапланированная;
				КонецЕсли;
				Если ЗначениеЗаполнено(СтрокаТЧ.ПредварительнаяЗапись) Тогда
					СтруктураДлительности             = Документы.Событие.ПолучитьПродолжительностьСобытия(СтрокаТЧ.ПредварительнаяЗапись);
					НоваяЗапись.ПредварительнаяЗапись = СтрокаТЧ.ПредварительнаяЗапись;
					НоваяЗапись.ДатаЗапланированная   = СтруктураДлительности.ДатаНачала;
					НоваяЗапись.Длительность          = СтруктураДлительности.Длительность; 
					НоваяЗапись.Статус                = Перечисления.СтатусыПрофосмотров.Согласился; 
					Если НоваяЗапись.ВидОсмотра = Перечисления.ВидыОсмотров.Профосмотр И Не ЗначениеЗаполнено(НоваяЗапись.Сделка) Тогда 
						НоваяЗапись.Сделка           = ОбщегоНазначения.ПолучитьЗначениеРеквизита(СтрокаТЧ.ПредварительнаяЗапись, "Сделка")
					КонецЕсли;
					Если Не ЗначениеЗаполнено(НоваяЗапись.Сотрудник) И Не ЗначениеЗаполнено(СтрокаТЧ.Сотрудник) Тогда 
						НоваяЗапись.Сотрудник         = ОбщегоНазначения.ПолучитьЗначениеРеквизита(СтрокаТЧ.ПредварительнаяЗапись, "Врач");
					КонецЕсли;
				КонецЕсли;									  
				Если НЕ ЗначениеЗаполнено(НоваяЗапись.Сотрудник) Тогда
					НоваяЗапись.Сотрудник             = СтрокаТЧ.Сотрудник; 					
				КонецЕсли; 
				Если НоваяЗапись.ВидОсмотра = Перечисления.ВидыОсмотров.Направление И НЕ ЗначениеЗаполнено(НоваяЗапись.НаправившийВрач) Тогда 
					НоваяЗапись.НаправившийВрач       = СтрокаТЧ.НаправившийВрач;
				КонецЕсли; 
				Если НоваяЗапись.ДатаЗапланированная <> СтрокаТЧ.ДатаЗапланированная Тогда
					НоваяЗапись.ДатаЗапланированная = СтрокаТЧ.ДатаЗапланированная;
				КонецЕсли;
				НоваяЗапись.Комментарий               = СтрокаТЧ.Комментарий;
				НаборЗаписей.Записать();			
			КонецЕсли; 
		КонецЕсли; 		
	КонецЦикла; 
	
КонецПроцедуры


#КонецОбласти
